# Задача 2.
__author__ = "Дмитрий Родионов"

number = input("Введите число >>> ")
sum_numbers = int(number) + int(number + number) + int(number + number + number)
print('Cумма чисел n + nn + nnn: ', sum_numbers)
